app/controllers/public/cart_items_controller.rb

  def index
    @cart_items = CartItem.all
---
SELECT "cart_items".* FROM "cart_items"