app/controllers/public/homes_controller.rb

SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT "genres".* FROM "genres"
---
  def top
    @items = Item.page(params[:page]).per(4)
    @genres = Genre.all