app/controllers/public/items_controller.rb

SELECT "genres".* FROM "genres"
SELECT "items"."id" FROM "items"
---
  def index
    @genres = Genre.all
    @items = Item.page(params[:page]).per(8)