app/controllers/public/orders_controller.rb

  def new
   @order = Order.new
   if current_customer.cart_items.count == 0
---
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]